package com.asiradnan.periodictable.utils

object NumberTranslator {
    private val englishToBanglaMap = mapOf(
        '0' to '০',
        '1' to '১',
        '2' to '২',
        '3' to '৩',
        '4' to '৪',
        '5' to '৫',
        '6' to '৬',
        '7' to '৭',
        '8' to '৮',
        '9' to '৯'
    )

    fun translateToBangla(number: String): String {
        return number.map { char ->
            englishToBanglaMap[char] ?: char
        }.joinToString("")
    }
}

fun toBanglaLabel(label: String): String {
    when (label) {
        ("Kind") -> return "প্রকার"
        ("Atomic Mass") -> return "পারমাণবিক ভর"
        ("Group") -> return "গ্রুপ"
        ("Period") -> return "পর্যায়"
        ("Protons") -> return "প্রোটন"
        ("Electrons") -> return "ইলেকট্রন"
        ("State") -> return "অবস্থা"
        ("Electronegativity") -> return "তড়িৎঋণাত্মকতা"
        ("Neutrons") -> return "নিউট্রন"
//        ("Liquid") -> return "তরল"
    }
    return label
}

fun toBanglaState(state: String): String {
    when (state) {
        ("Gas") -> return "বায়বীয়"
        ("Solid") -> return "কঠিন"
        ("Liquid") -> return "তরল"
    }
    return "অজ্ঞাত"
}

fun toBanglaKind(kind: String): String {
    when (kind) {
        ("Nonmetal") -> return banglaKinds[6]
        ("Noble Gas") -> return banglaKinds[8]
        ("Alkali Metal") -> return banglaKinds[0]
        ("Halogen") -> return banglaKinds[7]
        ("Alkaline Earth Metal") -> return banglaKinds[1]
        ("Metalloid") -> return banglaKinds[5]
        ("Lanthanide") -> return banglaKinds[2]
        ("Actinide") -> return banglaKinds[3]
        ("Transition Metal") -> return banglaKinds[4]

    }
    return "Post Transition Metal"
}

val banglaNames = listOf(
    "হাইড্রোজেন",
    "হিলিয়াম",
    "লিথিয়াম",
    "বেরিলিয়াম",
    "বোরন",
    "কার্বন",
    "নাইট্রোজেন",
    "অক্সিজেন",
    "ফ্লোরিন",
    "নিয়ন",
    "সোডিয়াম",
    "ম্যাগনেসিয়াম",
    "অ্যালুমিনিয়াম",
    "সিলিকন",
    "ফসফরাস",
    "সালফার",
    "ক্লোরিন",
    "আর্গন",
    "পটাশিয়াম",
    "ক্যালসিয়াম",
    "স্ক্যান্ডিয়াম",
    "টাইটানিয়াম",
    "ভ্যানাডিয়াম",
    "ক্রোমিয়াম",
    "ম্যাঙ্গানিজ",
    "আয়রন",
    "কোবাল্ট",
    "নিকেল",
    "কপার",
    "জিংক",
    "গ্যালিয়াম",
    "জার্মেনিয়াম",
    "আর্সেনিক",
    "সেলেনিয়াম",
    "ব্রোমিন",
    "ক্রিপ্টন",
    "রুবিডিয়াম",
    "স্ট্রনশিয়াম",
    "ইট্রিয়াম",
    "জিরকোনিয়াম",
    "নাইওবিয়াম",
    "মলিবডেনাম",
    "টেকনেশিয়াম",
    "রুথেনিয়াম",
    "রোডিয়াম",
    "প্যালাডিয়াম",
    "রূপা",
    "ক্যাডমিয়াম",
    "ইন্ডিয়াম",
    "টিন",
    "অ্যান্টিমনি",
    "টেলুরিয়াম",
    "আয়োডিন",
    "জেনন",
    "সিজিয়াম",
    "বেরিয়াম",
    "ল্যান্থানাম",
    "সিরিয়াম",
    "প্রাসিওডিমিয়াম",
    "নিওডিমিয়াম",
    "প্রমিথিয়াম",
    "স্যামারিয়াম",
    "ইউরোপিয়াম",
    "গ্যাডোলিনিয়াম",
    "টার্বিয়াম",
    "ডিস্প্রোসিয়াম",
    "হলমিয়াম",
    "ইরবিয়াম",
    "থুলিয়াম",
    "ইটারবিয়াম",
    "লুটেশিয়াম",
    "হাফনিয়াম",
    "ট্যানটালাম",
    "টাংস্টেন",
    "রেনিয়াম",
    "অসমিয়াম",
    "ইরিডিয়াম",
    "প্লাটিনাম",
    "সোনা",
    "পারদ",
    "থ্যালিয়াম",
    "সীসা",
    "বিসমাথ",
    "পোলোনিয়াম",
    "অ্যাস্টাটিন",
    "রেডন",
    "ফ্রান্সিয়াম",
    "রেডিয়াম",
    "অ্যাক্টিনিয়াম",
    "থোরিয়াম",
    "প্রোট্যাক্টিনিয়াম",
    "ইউরেনিয়াম",
    "নেপচুনিয়াম",
    "প্লুটোনিয়াম",
    "আমেরিসিয়াম",
    "কুরিয়াম",
    "বার্কেলিয়াম",
    "ক্যালিফোর্নিয়াম",
    "আইনস্টাইনিয়াম",
    "ফার্মিয়াম",
    "মেন্ডেলিভিয়াম",
    "নোবেলিয়াম",
    "লরেন্সিয়াম",
    "রাদারফোর্ডিয়াম",
    "ডুবনিয়াম",
    "সিবোর্গিয়াম",
    "বোহরিয়াম",
    "হ্যাসিয়াম",
    "মেইটনেরিয়াম",
    "ডার্মস্টাটিয়াম",
    "রন্টজেনিয়াম",
    "কোপার্নিসিয়াম",
    "নিহোনিয়াম",
    "ফ্লেরোভিয়াম",
    "মস্কোভিয়াম",
    "লিভারমোরিয়াম",
    "টেনেসাইন",
    "অগানেসন",
)
val banglaKinds = listOf(
    "ক্ষার ধাতু",
    "মৃৎক্ষার ধাতু",
    "ল্যান্থানাইড",
    "অ্যাক্টিনাইড",
    "অবস্থান্তর ধাতু",
    "ধাতুকল্প",
    "অন্যান্য অধাতু",
    "হ্যালোজেন",
    "নিষ্ক্রিয় গ্যাস",
    "অন্যান্য ধাতু"
)